
这里没有蠢问题
一、进制
    1、什么是十进制
    2、什么是二进制
    3、什么是八进制
    4、什么是十六进制

    5、C语言默认是几进制？
    6、C语言中如何表示一个二进制的数，
    7、C语言中如何表示一个八进制的数
    8、C语言中如何表示一个十六进制的数
    9、C语言中如何以八进制的形式输出一个数
    10、C语言中如何以十六进制的形式输出一个数

二、进制转换
    1、如何把一个10进制数转换为2进制数     如：20
    2、如何吧一个2进制数转换为一个十进制数
    3、如何把一个2进制数转换为一个8进制数
    4、如何把一个8进制数转换为2进制
    5、如何把一个2进制数转换为16进制
    6、如何把一个16进制数转换为2进制

三、位运算
    1、所有的位运算都是针对什么的？
    2、什么是按位与 &
    3、什么是按位或 |
    4、什么是异或 ^
    5、什么是取反 ~
    6、什么是左移 <<
    7、什么是右移 >>

/***********前面了解，后面的更重要************/

四、变量如何存储一个整型常量的，说说它在内存中的表现
五、类型说明符都有哪些，分别表示什么含义
六、C语言为什么要提供类型说明符
七、C语言中字符的实质是什么
八、char ch = 'A' 这句话做了什么事 ？
九、prinft("%c",ch) 这句话有做了什么事 ？


