
一、 填空题：

1、

--1--

__2___Computer __3__  NSObject{
    int _cup;
    double  _size;
}

- (void) playMusic _4_ (-5-) name;

-6-


2、

--1- Computer

- (void) playMusic _2_ (-3-) musicName{
    NSLog(@"播放-4-",musicName);
}

-5-

3、
int main()
{
    //创建Computer对象
    
    
    --------1-----------
    //播放音乐
    
    --------2-----------
    return 0;
}


二、问答题
1、请简述什么是面向对象
2、请简述什么是对象，请举例说明
3、请简述什么是类，可举例说明
4、请简述如何使用OC实现一个类

5、请简述对象在方法中是如何传递的，

6、请简述对象作为参数传入一个方法的使用场景，可举例说明

三、编程题
1、设计一个超级狗门，当狗在里面，狂吠要出去的时候，主人通过遥控器开关按钮控制狗门打开,狗出去，主人再按遥控器开关，关闭狗门,狗出去办完自己事情回来，狂叫要进去，主人通过遥控器的开关按钮，打开狗门，狗进来，主人再按开关遥控器开关按钮关闭狗门

   提示：只有狗门与遥控器是属于所要开发的系统， 人与狗是使用该系统外围事物。
        因此：只需设计狗门 与 遥控器即可




