//
//  main.c
//  01-二维数组的基本概念
//
//  Created by Apple on 14/11/9.
//  Copyright (c) 2014年 itcast. All rights reserved.
//

#include <stdio.h>
/*
   二维数组：元素为一维数组的数组
 
 
   一维数组：数据类型 数组名称[元素个数]
 
   二维数组：数据类型 数组名称[一维数组的个数][一维数组的元素个数];
 
   三维数组：数据类型 数组名称[二维数组的个数][一维数组的个数][一维数组的元素个数];
 
 二维数组的注意点：
    1、如果二维数组仅仅是定义没有初始化里面的元素都是垃圾值（不确定的值）
    
 
 */

void test()
{
    //   定义一个二维数组
    char scores[2][2];
    
    //  分别对每一个元素进行初始化
    scores[0][0] = 1;
    scores[0][1] = 100;
    
    scores[1][0] = 50;
    scores[1][1] = 50;
    
    
    
    //  遍历二维数组
    
    for (int i = 0; i < 2; i++) {
        
        for(int j = 0 ;j < 2;j++){
            printf("scores[%d][%d] = %d\n",i,j,scores[i][j]);
        }
        
    }
}

/*
   数组的多种初始化方式
 
 */
int main(int argc, const char * argv[]) {

//  1、先定义二维数组，然后进行初始化
    
// 注意点：
//    1、二维数组进行定义的同时初始化，那么没有显式初始化的元素会被自动初始化为0
//    2、定义二维数组的时候，必须要指定要一维数组的元素个数
    
//  2、定义二维数组的同时进行初始化
//
//    2.1 指定一维数组的个数同时对全部元素进行初始化
//    int scores[2][2] = {{1,100},{50,10}};
//    2.2 不指定一维数组的个数对数组中的全部元素进行初始化
//    int scores[][2] = {{1,100},{50,80}};
//    int scores[20][2] = {{60},{80}};
//    2.3 指定一维数组的元素个数,使用一个大括号方式进行初始化
//      int scores[2][2] = {1,2,3,4};
//      int scores[2][2] = {1,2,3};
     int scores[][2] = {1,2,3};
    
//    int scores[2][] = {{1,2},{3}};
    
    
    for (int i = 0; i < 2; i++) {
        
        for(int j = 0 ;j < 2;j++){
            printf("scores[%d][%d] = %d\n",i,j,scores[i][j]);
        }
        
    }
    return 0;
}
