
一、问答题

   1、请简述使用第一人称简述self的作用
      提示：谁调用我所在方法，我就是谁，我类方法中就是。。。。, 通过我可以调用。。。
           我再对象方法  中就是.... 通过我可以调用。。。。

   2、请问什么是继承
   3、请问为什么要使用继承
   4、请问在OC中如何实现继承
   5、请问继承的缺点是什么
   6、请问继承的注意点是什么
   7、请问继承使用场景是什么
   8、请问什么是isa关系

   9、请简述名字为description的对象方法的作用
   10、请简述名字为description类方法的作用

   11、请简述什么是多态
   12、在OC中如何实现多态
   13、开发中为什么要使用多态
   14、多态使用场景是什么，可举例说明

   15、什么是点语法
   16、点语法实质是什么
   17、为什么要使用点语法
   18、使用点语法注意点是什么

   19、什么是可见性
   20、控制属性可见性的关键字都有哪些
   21、@private修饰的成员变量在那里可见
   21、@protected修饰的成员变量在那里可见
   22、@public修饰成员变量在那里可见

   23、类的本质是什么
