//
//  main.c
//  1102-知识点回顾
//
//  Created by Apple on 14/11/2.
//  Copyright (c) 2014年 itcast. All rights reserved.
//

#include <stdio.h>
/*
   运算符：
   单目：操作数只有一个运算符
   双目：操作数有两个的运算符
   三目：操作数有三个的运算符
 
   算术运算符：+ - * / %
 
   优先级：优先级越高那么它两边的操作数优先与其结合
   结合方向：当优先级相同时候，操作数结合顺序
   结合方向：从左往右
 
   % 两边操作数必须为整数，正负性只与前面那个操作数的正负性一致
 
   赋值运算符： =  += -= *= /= %= 
   所有赋值运算符的优先级都是一样的，都低于算术运算符；其实赋值运算符是除了逗号运算符以外优先级最低的运算符
   赋值运算的结合方向：从右往左
 
   自增自减
   
   ++a;  首先a本身会自增1，整个表达式值是原来a + 1
   a++;  首先a本身会自增1，整个表达式值是原来a
 
   --a;  首先a本身会自减1，整个表达式值是原来a - 1
   a--;  首先a本身会自减1，整个表达式值是原来a
 
   sizeof运算符：用来计算变量、常量、数据类型所占用存储空间的字节数的
   常量 sizeof(常量)  sizeof 常量
   变量 sizeof(变量)  sizeof 变量
   数据类型  sizeof(数据类型)
 
   逗号运算符
   优先级：所有运算符中最低的
   结合方向：从左往右
   逗号表达式的值：最后一个表达式值
  
   关系运算符 > < >= <=  == !=
   
   优先级： 关系运算符优先级低于算术运算符高于赋值运算符；
           前面四个的优先级要高于后面两个
   结合方向：从右往左
   特点：关系表达式的返回结果只有两个，就是真(1)或假(0)
   
   逻辑运算符： 
   
   &&:一假则假，如果前面那个表达式为假那么后面那个表达式就不参与运算了
 
   ||：一真则真，如果前面那个表达式为真那么后面那个表达式就不参与运算了
   
   && 优先级高于 ||
   &&，|| 优先级要低于关系运算符 高于赋值运算符
   当我们不明确优先级的时候，就是用() 来明确优先级；
 
   !：假变真，真变假
 
   三目运算符：
   
   条件表达式 ? 结果1 ： 结果2
 
 
 */
int main(int argc, const char * argv[]) {
  
   
    
    
    
    
    
    
    return 0;
}
