1.设计2个类，关系自拟
1> 人（Person）
* 3个属性：姓名、年龄、身高
* 2个自定义构造方法：可以同时初始化姓名、年龄，可以同时初始化姓名、年龄、身高

2> 学生（Student）
* 4个属性：姓名、年龄、身高、学号
* 1个自定义的构造方法：可以同时初始化姓名、年龄、学号

3> 测试代码
* 利用自定义构造方法创建一个姓名为Rose、年龄20的人
* 利用自定义构造方法创建一个姓名为Jack、年龄30、身高150的人
* 利用自定义构造方法创建一个姓名为Jim、年龄25的学生
* 利用自定义构造方法创建一个姓名为Jake、年龄28、身高170的学生
* 利用自定义构造方法创建一个姓名为Kate、年龄26、学号10的学生

2.给所有OC对象增加1个分类，分类名称自拟
* 增加一个类方法输出类名
* 增加一个对象输出类名
测试代码：
* 拿NSObject、NSString、前面的Person、Student进行测试

3.给NSString这个类增加1个分类，分类名称自拟
* 增加一个类方法计算某个字符串内部英文字母的个数
* 增加一个对象方法计算当前字符串内部英文字母的个数

* 增加一个类方法比较两个字符串的长度，返回长度差
* 增加一个对象方法和其他字符串比较长度，返回长度差

测试代码：
* 随便创建几个字符串类型进行测试