//
//  main.c
//  04-位运算(理解)
//
//  Created by Apple on 14/11/6.
//  Copyright (c) 2014年 itcast. All rights reserved.
//

#include <stdio.h>
/*
  位运算：针对二进制位运算
 
  & 按位与:对应的二进制位上，一个为0就是0，全1才为1
          一假则假
 
  | 按位或 对应的二进制位上，一个为1就是1，全0才为0
          一真则真
 
  ^ 按位异或 对应的二进制位上，不同为1，相同为0
            1、多个数相互异或交换顺序结果不变（类似加法交换律）
            2、任何数异或上0都是原来的数
            3、相同的数相互异或结果为0
  ~ 按位取反:对应的二进制位上，0变1，1变0
 
  >> 右移  m >> n :  m 向右移动n位:移出来的位直接删掉，移入位补符号位(正数补0，负数补1)
           使用场景：快速计算一个数除以2的n次方，对于一个整数来说右移几位就是除以2几次方
 
  << 左移  m << n : m 向左移动n位，移出来的位直接删掉，移入位补0
          左移可能会改变符号位
          使用场景：当数比较小时候，可以快速的计算这个数乘以2多少次方
  快速计算2的3次方
 
 */
int main(int argc, const char * argv[]) {
   
    int a = 10;
    int rs  =   a >> 2;
    
    
    rs = a << 28;
    printf("%d\n",rs);
   /*
     0000 0000 0000 0000 0000 0000 0000 1010  >> 2

------------------------------------------------
     000000 0000 0000 0000 0000 0000 0000 10
    
    */
    
    /*
     0000 0000 0000 0000 0000 0000 0000 1010  << 28
     
     ------------------------------------------------
     1010 0000 0000 0000 0000 0000 0000 0000
     
     */
    
    rs = 1 << 3;
    
    printf("%d\n",rs);
    
    
    return 0;
}


void test()
{
    int a = 13;
    int b = 9;
    
    int rs = a & b;
    printf("%d\n",rs);
    /*
     1101
     & 1001
     -----------
     1001
     
     */
    
    rs = a | b;
    printf("%d\n",rs);
    /*
     1101
     | 1001
     -----------
     1101
     
     */
    
    
    rs = a ^ b;
    printf("%d\n",rs);
    /*
     1101
     ^ 1001
     -----------
     0100
     
     */
    
    int c = 10;
    
    rs = c ^ b ^ a;
    
    rs = c ^ 0;
    
    rs = c ^ c;
    /*
     
     1100
     ^ 0000
     -----------
     1100
     
     */
    
    printf("rs = %d\n",rs);
    
    rs = ~c;
    //    -10 = ~10 + 1
    //    ~10 = -10 - 1 = -11
    /*
     ~0000 0000 0000 0000 0000 0000 0000 1010
     -------------------------------------------
     1111 1111 1111 1111 1111 1111 1111 0101
     
     
     */
    printf("%d\n",0b11111111111111111111111111110101);
    
}