
一、运算符
    1、判断题
      (1) int a = 2.1 % 2;  __

      (2) int a,b,c;
          a = b = c = 10;
    2、填空题
      (1)   int a = 2,b = 5,c,d
            c  = b / a + b % a
            d  = b / a * b % a
            执行完后c = __  d = ___
      (2) 假设 num 是一个任意的正整数，表达式 num __ 5 结果总是在[0,5]这个闭区间，
      (3)  int a = 2,b = 3;
           a += a * b + 1 //此处a = __
           a *= a * b + 1 //此处a = __
      (4)  int a = 0,b;
            b = ++a;//此处a = __ b = __
            b = a++ //此处a = __ b = __
      (5)  int a = 0,b;
            b = a++ + a++;//此处a = __ b = __
            b = ++a + ++a;//此处a = __ b = __
            b = ++a + a++;//此处a = __ b = __
            b = a++ + ++a;//此处a = __ b = __
      (6)   假设变量 a 的值不确定，判断a在(5,10]这个区间的表达式是
            _____________________
                              
    /****7、8、9在开发遇到的几率相当于中彩票，但它可以帮助更好理解知识点***/
      (7)  int a = 1,b = 1,c;
           c = --a && b++ || a++ //此处 a = __ b = __ c = __
      (8)  int a = 1,b = 1,c;
           c = --a || b++ && ++a //此处 a = __ b = __ c = __
      
      (9)  int a = 2 b = 2,c;
           c = ++a > b ? a : b * 10//此处c = __

最后、这里没有蠢问题：
1、所有的运算符都一个共同的特点，这个特点是什么 ？
2、算术运算符都有那些，他们是干嘛用的 ？
3、在所有的运算符中谁的优先级是最高的？
4、赋值运算符有返回值吗？如果有他的返回值是什么？
5、赋值运算符都有哪些？分别是干嘛的？
6、比较运算符都有哪些？分别是干嘛的？
7、逻辑运算符是干嘛用的，逻辑运算符都哪些？
8、sizeof的作用是什么？sizeof 后面的操作数可以是什么 ？
9、逗号运算符的结合方向是什么？逗号表达式的值是什么 ？
10、三目条件运算的格式是什么，它的返回值是什么？
                              

                              


